Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/faq-structure_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: faq-structure title: File Structure permalink: docs/faq-structure.html layout: docs category: FAQ ---
ja: --- id: faq-structure title: ファイル構成 permalink: docs/faq-structure.html layout: docs category: FAQ ---

source: ### Is there a recommended way to structure React projects?
ja: ### お勧めの React プロジェクトの構成は？

source: React doesn't have opinions on how you put files into folders.
ja: React はファイルをどのようにフォルダ分けするかについての意見を持っていません。

source: That said there are a few common approaches popular in the ecosystem you may want to consider.
ja: とはいえ、あなたが検討したいかもしれないエコシステム内でよく用いられる共通の方法があります。

source: #### Grouping by features or routes {#grouping-by-features-or-routes}
ja: #### 機能ないしルート別にグループ化する {#grouping-by-features-or-routes}

source: One common way to structure projects is to locate CSS, JS, and tests together inside folders grouped by feature or route.
ja: プロジェクトを構成する一般的な方法の 1 つは、CSS や JS やテストをまとめて、機能別ないしルート別のフォルダにグループ化するというものです。

source: The definition of a "feature" is not universal, and it is up to you to choose the granularity.
ja: ここでの「機能」の定義は普遍的なものではないので、粒度の選択はあなた次第です。

source: If you can't come up with a list of top-level folders, you can ask the users of your product what major parts it consists of, and use their mental model as a blueprint.
ja: トップレベルのフォルダの名前が思いつかない場合は、ユーザに「この製品の主な構成部品は何か」と聞いてみて、ユーザの思考モデルを青写真として使いましょう。

source: #### Grouping by file type {#grouping-by-file-type}
ja: #### ファイルタイプ別にグループ化する {#grouping-by-file-type}

source: Another popular way to structure projects is to group similar files together, for example:
ja: プロジェクトを構築する別の人気の方法は、例えば以下のようにして類似ファイルをグループ分けするというものです。

source: Some people also prefer to go further, and separate components into different folders depending on their role in the application.
ja: 人によってはこの方法をさらに推し進め、コンポーネントをアプリケーション内の役割に応じてフォルダ分けすることを好みます。

source: For example, [Atomic Design](http://bradfrost.com/blog/post/atomic-web-design/) is a design methodology built on this principle.
ja: 例として、[Atomic Design](http://bradfrost.com/blog/post/atomic-web-design/) はこのような原則の下に作られたデザインの方法論です。

source: Remember that it's often more productive to treat such methodologies as helpful examples rather than strict rules to follow.
ja: ただこのような方法論は、従わなければならない厳格なルールとして扱うよりも、役に立つ見本として扱う方が多くの場合生産的であるということを忘れないでください。

source: #### Avoid too much nesting {#avoid-too-much-nesting}
ja: #### ネストのしすぎを避ける {#avoid-too-much-nesting}

source: There are many pain points associated with deep directory nesting in JavaScript projects.
ja: 深くネストされた JavaScript プロジェクトには様々な痛みを伴います。

source: It becomes harder to write relative imports between them, or to update those imports when the files are moved.
ja: 相対パスを使ったインポートが面倒になりますし、ファイルが移動したときにそれらを更新するのも大変です。

source: Unless you have a very compelling reason to use a deep folder structure, consider limiting yourself to a maximum of three or four nested folders within a single project.
ja: よほど強い理由があって深いファルダ構造を使う場合を除き、1 つのプロジェクト内では 3 段か 4 段程度のフォルダ階層に留めることを考慮してください。

source: Of course, this is only a recommendation, and it may not be relevant to your project.
ja: もちろんこれはお勧めにすぎず、あなたのプロジェクトには当てはまらないかもしれません。

source: #### Don't overthink it {#dont-overthink-it}
ja: #### 考えすぎない {#dont-overthink-it}

source: If you're just starting a project, [don't spend more than five minutes](https://en.wikipedia.org/wiki/Analysis_paralysis) on choosing a file structure.
ja: まだプロジェクトを始めたばかりなら、ファイル構成を決めるのに [5 分以上かけない](https://en.wikipedia.org/wiki/Analysis_paralysis)ようにしましょう。

source: Pick any of the above approaches (or come up with your own) and start writing code!
ja: 上述の方法の 1 つを選ぶか、自分自身の方法を考えて、コードを書き始めましょう！

source: You'll likely want to rethink it anyway after you've written some real code.
ja: おそらく実際のコードをいくらか書けば、なんにせよ考え直したくなる可能性が高いでしょう。

source: If you feel completely stuck, start by keeping all files in a single folder.
ja: もしも完全に詰まった場合は、すべて 1 フォルダに入れるところから始めましょう。

source: Eventually it will grow large enough that you will want to separate some files from the rest.
ja: そのうち十分に数が増えれば、いくつかのファイルを分離したくなってくるでしょう。

source: By that time you'll have enough knowledge to tell which files you edit together most often.
ja: そのころには、どのファイルを一緒に編集している頻度が高いのか、十分わかるようになっているでしょう。

source: In general, it is a good idea to keep files that often change together close to each other.
ja: 一般的には、よく一緒に変更するファイルを近くに置いておくのは良いアイディアです。

source: This principle is called "colocation".
ja: この原則は、「コロケーション」と呼ばれます。

source: As projects grow larger, they often use a mix of both of the above approaches in practice.
ja: プロジェクトが大きくなるにつれ、実際にはしばしば上記両方の方法が組み合わされて使用されます。

source: So choosing the "right" one in the beginning isn't very important.
ja: ですので、「正しい」方法を最初から選択することはさほど重要ではありません。
